(require "mecab.arc")
(require "re.arc")
(require "test.arc")

(test iso (mecab "普通のやつらの上を行け")
          '(("普通" "名詞,形容動詞語幹,*,*,*,*,普通,フツウ,フツー")
            ("の"   "助詞,連体化,*,*,*,*,の,ノ,ノ")
            ("やつ" "名詞,代名詞,一般,*,*,*,やつ,ヤツ,ヤツ")
            ("ら"   "名詞,接尾,一般,*,*,*,ら,ラ,ラ")
            ("の"   "助詞,連体化,*,*,*,*,の,ノ,ノ")
            ("上"   "名詞,非自立,副詞可能,*,*,*,上,ウエ,ウエ")
            ("を"   "助詞,格助詞,一般,*,*,*,を,ヲ,ヲ")
            ("行け" "動詞,自立,*,*,一段,連用形,行ける,イケ,イケ")))

(test iso (mecab "普通のやつらの上を行け" [car _])
          '("普通"
            "の"
            "やつ"
            "ら"
            "の"
            "上"
            "を"
            "行け"))

(test iso (mecab "普通のやつらの上を行け" [cadr _])
          '("名詞,形容動詞語幹,*,*,*,*,普通,フツウ,フツー"
            "助詞,連体化,*,*,*,*,の,ノ,ノ"
            "名詞,代名詞,一般,*,*,*,やつ,ヤツ,ヤツ"
            "名詞,接尾,一般,*,*,*,ら,ラ,ラ"
            "助詞,連体化,*,*,*,*,の,ノ,ノ"
            "名詞,非自立,副詞可能,*,*,*,上,ウエ,ウエ"
            "助詞,格助詞,一般,*,*,*,を,ヲ,ヲ"
            "動詞,自立,*,*,一段,連用形,行ける,イケ,イケ"))

(test iso (mecab "普通のやつらの上を行け" (fn ((s f)) (when (re-match-pat "^名詞" f) s)))
          '("普通"
            "やつ"
            "ら"
            "上"))

(test iso (mecab "普通のやつらの上を行け" (fn ((s f)) (when (re-match-pat "^動詞" f) s)))
          '("行け"))

(test iso (mecab "普通のやつらの上を行け" (fn ((s f)) (when (len> s 1) s)))
          '("普通"
            "やつ"
            "行け"))

(done-testing)

; vim: ft=arc
